/***************************************************************************************************
*                    (c) Copyright 1992-2017 Embedded Products Research Center
*                                       All Rights Reserved
*
*\File          motor.h
*\Description   电机控制相关操作
*\Note          1)电机功率计算公式 P=U×I×1.732×cosφ   如:380X35X1.732X0.8
                2)电流和电压的有效值与最大值的关系为：U=Um/1.414约等于0.707*Um   
                                                    I=Im/1.414约等于0.707*Im
*\Log           2017.11.09    Ver 1.0    骆兆松
*               创建文件。
***************************************************************************************************/
#ifndef _MOTOR_CTRL_H
#define _MOTOR_CTRL_H
#include "gpio_cfg.h"
#include "board.h"

#include "para.h"
/*
由停止到开始时，先控制方向继电器，等方向继电器稳定后再控制开始
由运行状态到停止时，需要先停止开始继电器
*/
#define RC_START_ST 1     /**/
#define RC_STOP_ST  0

#define RC_DIR_ZHENG    0  /*正转*/
#define RC_DIR_FAN      1  /*反转*/ 

extern u8 RelayCtrlStart;  /*继电器控制:开始  0:对应宏定义OFF     1:对应宏定义ON  */
extern u8 RelayCtrlDir  ;  /*继电器控制:方向 0:正转 对应宏定义OFF 1: 反转 对应宏定义ON*/

/***************************************************************************************************
*\Function      StartRelayCtrl
*\Description   进入启动状态时继电器控制
***************************************************************************************************/
void StartRelayCtrl(void);

/***************************************************************************************************
*\Function      DiandongRelayCtrl
*\Description   进入点动反转状态时继电器控制
***************************************************************************************************/
void DiandongRelayCtrl(void);

/***************************************************************************************************
*\Function      StopRelayCtrl
*\Description   进入停止状态时继电器控制
***************************************************************************************************/
void StopRelayCtrl(void);

/***************************************************************************************************
*\Function      ExceptionCheck
*\Description   电流异常情况检查
*\Parameter     
*\Return        void
*\Note          
*\Log           2017.11.14    Ver 1.0    骆兆松
*               创建函数。
***************************************************************************************************/
void ExceptionCheck(void);

//继电器控制刷新
void RelayCtrlRefresh(void);

#endif /*_MOTOR_CTRL_H*/
